In [1]:
from datascience import *
import numpy as np

%matplotlib inline
import matplotlib.pyplot as plots
plots.style.use('fivethirtyeight')

# Lecture 11 #

## Lists

In [2]:
simple_list = ['hello', 7, 3.14, True]
simple_list

['hello', 7, 3.14, True]

In [3]:
my_array = make_array('hello', 7, 3.14, True)
my_array # arrays want all elements to be of the same data type
# all integers, all floats, all strings, etc.

array(['hello', '7', '3.14', 'True'], dtype='<U5')

In [4]:
my_array = make_array(1, 2, 3)

crowded_list = [my_array, 'what is going on', -10]
crowded_list

[array([1, 2, 3]), 'what is going on', -10]

In [5]:
Table().with_columns('Numbers', [1, 2, 3])

Numbers
1
2
3

In [6]:
drinks = Table(['Drink', 'Cafe', 'Price']) # column headings, using a list
drinks

Drink | Cafe | Price

In [7]:
drinks = drinks.with_rows([
    ['Milk Tea', 'Asha', 5.50],
    ['Espresso', 'Strada',  1.75],
    ['Latte',    'Strada',  3.25],
    ['Espresso', "FSM",   2]
])
drinks

Drink    | Cafe   | Price
Milk Tea | Asha   | 5.5
Espresso | Strada | 1.75
Latte    | Strada | 3.25
Espresso | FSM    | 2

## Challenge Question ##

In [8]:
sky = Table.read_table('data/skyscrapers_v2.csv')
sky = (sky.with_column('age', 2020 - sky.column('completed'))
          .drop('completed'))
sky.show(3)

In [9]:
# 1. For each city, whatâ€™s the tallest building for each material?
#sky.where('material','concrete').sort('height', descending = True).item(0)
sky.select('material','height').group('material',max)

# the tallest building for concrete
# tallest building for mixed/composite
# tallest building for steel

# can you provide all three information above in one table?

material        | height max
concrete        | 425.5
mixed/composite | 541.3
steel           | 442.14

In [10]:
sky.select('material', 'city', 'height').group(['city', 'material'], max)

city      | material        | height max
Atlanta   | concrete        | 264.25
Atlanta   | mixed/composite | 311.8
Atlanta   | steel           | 169.47
Austin    | concrete        | 208.15
Austin    | steel           | 93.6
Baltimore | concrete        | 161.24
Baltimore | steel           | 155.15
Boston    | concrete        | 121.92
Boston    | mixed/composite | 139
Boston    | steel           | 240.79
... (81 rows omitted)

In [12]:
# 2. For each city, whatâ€™s the height difference between the tallest 
#    steel building and the tallest concrete building?




#sky.pivot('city','material') # default, is to give # of things in city, for material (count)
#sky.pivot('material', 'city')

sky.pivot('material','city','age',max) 
# oldest building for each material, in each city
# atlanta - oldest building for concrete, composite, steel

city       | concrete | mixed/composite | steel
Atlanta    | 44       | 33              | 123
Austin     | 36       | 0               | 83
Baltimore  | 53       | 0               | 109
Boston     | 49       | 28              | 105
Charlotte  | 28       | 18              | 96
Chicago    | 91       | 94              | 132
Cincinnati | 66       | 9               | 107
Cleveland  | 40       | 62              | 96
Columbus   | 57       | 0               | 93
Dallas     | 42       | 35              | 92
... (25 rows omitted)

Don't read ahead until you try the challenge questions yourself first!

### Take-home question: try it here!

In [ ]:
# Generate a table of the names of the oldest buildings for each 
# material for each city: (requires join)


# generate a table of the average ages of buildings, by material, for each city:

## Joins ##

In [ ]:
drinks

In [ ]:
discounts = Table().with_columns(
    'Coupon % off', make_array(10, 25, 5),
    'Location', make_array('Asha', 'Strada', 'Asha')
)
discounts

In [ ]:
combined = drinks.join('Cafe', discounts, 'Location')
combined

In [ ]:
discounted_frac = 1 - combined.column('Coupon % off') / 100
combined.with_column(
    'Discounted Price', 
    combined.column('Price') * discounted_frac
)

In [ ]:
drinks.join('Cafe', drinks, 'Cafe')